In [1]:
import pandas as pd
read=pd.read_csv('Book1.csv')
print(read)

   sl no     name  age   place
0      1      anu   12     tvm
1      2    deepa   54     tvm
2      3  fathima   45  kollam
3      4    nihal   23     tvm
4      5   geetha   34     tvm

In [2]:
import pandas as pd
r=pd.read_csv('123456.csv')
print(r)

         name  age  salary
0         ram   40      40
1   navishiya    6      60
2     anushka   79      90
3        paru   46      95
4   catherine   30      10
5        vasu   70      30
6       laila    7      40
7      majunu    9      70
8         kom    8      12
9        lisa    9      85
10        abi    7      58
11      vazha    5      64

In [4]:
import pandas as pd
r=pd.read_csv('123456.csv')
print(r.head(7))

        name  age  salary
0        ram   40      40
1  navishiya    6      60
2    anushka   79      90
3       paru   46      95
4  catherine   30      10
5       vasu   70      30
6      laila    7      40

In [5]:
import pandas as pd
r=pd.read_csv('123456.csv')
print(r.tail())

      name  age  salary
7   majunu    9      70
8      kom    8      12
9     lisa    9      85
10     abi    7      58
11   vazha    5      64

In [6]:
import pandas as pd
r=pd.read_csv('123456.csv')
print(r.describe())

             age     salary
count  12.000000  12.000000
mean   26.333333  54.500000
std    26.664015  28.621352
min     5.000000  10.000000
25%     7.000000  37.500000
50%     9.000000  59.000000
75%    41.500000  73.750000
max    79.000000  95.000000

In [8]:
import pandas as pd
r=pd.read_csv('123456.csv')
print(r.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    12 non-null     object
 1   age     12 non-null     int64
 2   salary  12 non-null     int64
dtypes: int64(2), object(1)
memory usage: 420.0+ bytes
None

In [9]:
import pandas as pd
r=pd.read_csv('123456.csv')
print(r.shape)

(12, 3)

In [10]:
import pandas as pd
r=pd.read_csv('123456.csv')
print(r.columns)

Index(['name', 'age', 'salary'], dtype='object')

In [17]:
import pandas as pd
df=pd.DataFrame({'name':['alice','bob','charlie','dave'],'gender':['f', 'm','m','unknown'],'score':[85,90,-1,96]})
print(df)

      name   gender  score
0    alice        f     85
1      bob        m     90
2  charlie        m     -1
3     dave  unknown     96

In [22]:
import pandas as pd
df=pd.DataFrame({'name':['alice','bob','charlie','dave'],
                 'gender':['f', 'm','m','unknown'],
                 'score':[85,90,-1,96]})
df['score']=df['score'].replace(-1,0)
print(df)

      name   gender  score
0    alice        f     85
1      bob        m     90
2  charlie        m      0
3     dave  unknown     96

In [25]:
import pandas as pd
df=pd.DataFrame({'name':['alice','bob','charlie','dave'],
                 'gender':['f', 'm','m','unknown'],
                 'score':[85,90,-1,96]})
df['gender']=df['gender'].replace(['f','m'],'known')
print(df)

      name   gender  score
0    alice    known     85
1      bob    known     90
2  charlie    known     -1
3     dave  unknown     96

In [2]:
import pandas as pd
df=pd.DataFrame({'name':['alice','bob','charlie','dave'],
                 'gender':['f', 'm','m','unknown'],
                 'score':[85,90,-1,96]})
df

      name   gender  score
0    alice        f     85
1      bob        m     90
2  charlie        m     -1
3     dave  unknown     96

In [24]:
import pandas as pd

df = pd.DataFrame({
    'name': ['alice', 'bob', 'charlie', 'dave'],
    'gender': ['f', 'm', 'm', 'unknown'],
    'score': [85, 90, -1, 96]
})

df['gender'] = df['gender'].replace({'f': 'female', 'm': 'male', 'unknown': 'unspecified'})

print(df)

      name       gender  score
0    alice       female     85
1      bob         male     90
2  charlie         male     -1
3     dave  unspecified     96

In [19]:
import pandas as pd
df=pd.DataFrame({
    'name':['Alice','bob','charlie','dave'],
    'gender':['f', 'm','m','unknown'],
    'score':[85,90,-1,96]})
df['name'] = df['name'].replace(r'^a.*', 'name start with a', regex=True)
print(df)

      name   gender  score
0    Alice        f     85
1      bob        m     90
2  charlie        m     -1
3     dave  unknown     96

In [21]:
import pandas as pd
df=pd.DataFrame({
    'name':['alice','bob','charlie','dave'],
    'gender':['f', 'm','m','unknown'],            
    'score':[85,90,-1,96]})
df=df.replace('unknown','missing')
print(df)

      name   gender  score
0    alice        f     85
1      bob        m     90
2  charlie        m     -1
3     dave  missing     96

In [46]:
import pandas as pd
df=pd.DataFrame({
    'name':['alice','bob','charlie','dave'],
    'gender':['f', 'm','m','unknown'],
    'score':[85,90,-1,96]})
df=df.rename(columns={'name':'new_name'},inplace=False)
print(df)

  new_name   gender  score
0    alice        f     85
1      bob        m     90
2  charlie        m     -1
3     dave  unknown     96

In [43]:
import pandas as pd

df = pd.DataFrame({
    'name': ['alice', 'bob', 'charlie', 'dave'],      
    'gender': ['f', 'm', 'm', 'unknown'],
    'score': [85, 90, -1, 96]})
df = df.rename(columns={'name': 'full_name'}, inplace=False)
print(df)

  full_name   gender  score
0     alice        f     85
1       bob        m     90
2   charlie        m     -1
3      dave  unknown     96

In [24]:
import pandas as pd

df = pd.DataFrame({
    'name': ['alice', 'bob', 'charlie', 'dave'],
    'gender': ['f', 'm', 'm', 'unknown'],
    'score': [85, 90, -1, 96]})
df_renamed=df.rename(columns={'name':'NAME','gender':'city'})
print(df_renamed)

      NAME     city  score
0    alice        f     85
1      bob        m     90
2  charlie        m     -1
3     dave  unknown     96

In [58]:
import pandas as pd
import numpy as np

df = pd.DataFrame({
    'name': ['alice', 'bob', 'charlie', 'dave'],
    'city': ['f', 'm', 'malyasia','ny'],
    'age': [85, 90, -1, 96]})
print(df)

      name      city  age
0    alice         f   85
1      bob         m   90
2  charlie  malyasia   -1
3     dave        ny   96

In [2]:
import pandas as pd
r=pd.read_csv('book10.csv')
print(r)

      name  age  salary
0      ram   24   50000
1     nili   21  100000
2     manu   45   32000
3     vena   36   40000
4    gowri   42  120000
5     vasu   32   40000
6     mani   45  250000
7     daya   34   70000
8  krishna   23   50000
9  narayan   32   60000

In [3]:
import pandas as pd
r=pd.read_csv('book10.csv')
print(r.head(5))

    name  age  salary
0    ram   24   50000
1   nili   21  100000
2   manu   45   32000
3   vena   36   40000
4  gowri   42  120000

In [4]:
import pandas as pd
r=pd.read_csv('book10.csv')
print(r.tail(6))

      name  age  salary
4    gowri   42  120000
5     vasu   32   40000
6     mani   45  250000
7     daya   34   70000
8  krishna   23   50000
9  narayan   32   60000

In [6]:
import pandas as pd
r=pd.read_csv('book10.csv')
print(r.columns)

Index(['name', 'age', 'salary'], dtype='object')

In [7]:
import pandas as pd
r=pd.read_csv('book10.csv')
print(r.shape)

(10, 3)

In [9]:
import pandas as pd
r=pd.read_csv('book10.csv')
print(r.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    10 non-null     object
 1   age     10 non-null     int64
 2   salary  10 non-null     int64
dtypes: int64(2), object(1)
memory usage: 372.0+ bytes
None

In [10]:
import pandas as pd
r=pd.read_csv('book10.csv')
print(r.describe())

             age         salary
count  10.000000      10.000000
mean   33.400000   81200.000000
std     8.846845   65565.573622
min    21.000000   32000.000000
25%    26.000000   42500.000000
50%    33.000000   55000.000000
75%    40.500000   92500.000000
max    45.000000  250000.000000

In [12]:
import pandas as pd
r=pd.read_csv('book10.csv')
print(r['name'])

0        ram
1       nili
2       manu
3       vena
4      gowri
5       vasu
6       mani
7       daya
8    krishna
9    narayan
Name: name, dtype: object

In [13]:
import pandas as pd
r=pd.read_csv('book10.csv')
print(r['age'].min())

21

In [14]:
import pandas as pd
r=pd.read_csv('book10.csv')
print(r['age'].max())

45

In [15]:
import pandas as pd
r=pd.read_csv('book10.csv')
print(r['salary'].max())

250000

In [16]:
import pandas as pd
r=pd.read_csv('book10.csv')
print(r['salary'].min())

32000

In [27]:
import pandas as pd
import numpy as np

df = pd.DataFrame({
    'name': ['alice', 'bob', 'charlie', 'dave'],
    'city': ['france', 'singapore', 'malyasia',np.nan],
    'age': [85, np.nan, -1, 96]})
print(df)

      name       city   age
0    alice     france  85.0
1      bob  singapore   NaN
2  charlie   malyasia  -1.0
3     dave        NaN  96.0

In [34]:
import pandas as pd
import numpy as np

data= ({
    'name': ['alice', 'bob', 'charlie', 'dave'],
    'city': ['france', 'singapore', 'malyasia',np.nan],
    'age': [85, np.nan, -1, 96]})
df=pd.DataFrame(data)
print(df.isnull())

    name   city    age
0  False  False  False
1  False  False   True
2  False  False  False
3  False   True  False

In [36]:
import pandas as pd
import numpy as np

data= ({
    'name': ['alice', 'bob', 'charlie', 'dave'],
    'city': ['france', 'singapore', 'malyasia',np.nan],
    'age': [85, np.nan, -1, 96]})
df=pd.DataFrame(data)
print(df.dropna())

      name      city   age
0    alice    france  85.0
2  charlie  malyasia  -1.0

In [37]:
import pandas as pd
import numpy as np

data= ({
    'name': ['alice', 'bob', 'charlie', 'dave'],
    'city': ['france', 'singapore', 'malyasia',np.nan],
    'age': [85, np.nan, -1, 96]})
df=pd.DataFrame(data)
print(df.dropna(axis=1))

      name
0    alice
1      bob
2  charlie
3     dave

In [39]:
import pandas as pd
import numpy as np

data= ({
    'name': ['alice', 'bob', 'charlie', 'dave'],
    'city': ['france', 'singapore', 'malyasia',np.nan],
    'age': [85, np.nan, -1, 96]})
df=pd.DataFrame(data)
print(df.fillna(0))

      name       city   age
0    alice     france  85.0
1      bob  singapore   0.0
2  charlie   malyasia  -1.0
3     dave          0  96.0

In [41]:
import pandas as pd
import numpy as np

data= ({
    'name': ['alice', 'bob', 'charlie', 'dave'],
    'city': ['france', 'singapore', 'malyasia',np.nan],
    'age': [85, np.nan, -1, 96]})
df=pd.DataFrame(data)
print(df.fillna("unknown"))

      name       city      age
0    alice     france     85.0
1      bob  singapore  unknown
2  charlie   malyasia     -1.0
3     dave    unknown     96.0

In [46]:
import pandas as pd
import numpy as np

data= ({
    'name': ['alice', 'bob', 'charlie', 'dave'],
    'city': ['france', 'singapore', 'malyasia',np.nan],
    'age': [85, np.nan, -1, 96]})
df=pd.DataFrame(data)
df['age']=pd.to_numeric(df['age'],errors='coerce')
df['age']=df['age'].fillna(df['age'].mean())
print(df)

      name       city   age
0    alice     france  85.0
1      bob  singapore  60.0
2  charlie   malyasia  -1.0
3     dave        NaN  96.0

In [1]:
import pandas as pd
import numpy as np

data= ({
    'name': ['alice', 'bob', 'charlie', 'dave'],
    'city': ['france', 'singapore', 'malyasia',np.nan],
    'age': [85, np.nan, -1, 96]})
df=pd.DataFrame(data)
df=df.fillna(method='ffill')
print(df)

      name       city   age
0    alice     france  85.0
1      bob  singapore  85.0
2  charlie   malyasia  -1.0
3     dave   malyasia  96.0

C:\Users\Euroview7\AppData\Local\Temp\ipykernel_7216\39385106.py:9: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df=df.fillna(method='ffill')

In [4]:
import pandas as pd
import numpy as np

data= ({
    'name': ['alice', 'bob', 'charlie', 'dave'],
    'city': ['france', 'singapore', 'malyasia',np.nan],
    'age': [85, np.nan, -1, 96]})
df=pd.DataFrame(data)
df['age']=pd.to_numeric(df['age'],errors='coerce')
df['age']=df['age'].fillna(df['age'].mean())
df.to_csv("outoutfile.csv")

In [3]:
import pandas as pd
df=pd.DataFrame({
    'A':[1,2,2,3,3,3],
    'B':['a','b','b','c','c','c']})
df.duplicated()

0    False
1    False
2     True
3    False
4     True
5     True
dtype: bool

In [4]:
import pandas as pd
df=pd.DataFrame({
    'A':[1,2,2,3,3,3],
    'B':['a','b','b','c','c','c']})
df.drop_duplicates()

   A  B
0  1  a
1  2  b
3  3  c

In [7]:
import pandas as pd
df=pd.DataFrame({
    'A':[1,2,3],
    'B':['a','b','c']})
df['c']=10
df

   A  B   c
0  1  a  10
1  2  b  10
2  3  c  10

In [9]:
import pandas as pd
df=pd.DataFrame({
    'A':[1,2,3],
    'B':['a','b','c']})
df['c']=10
df['d']=[100,200,300]
df

   A  B   c    d
0  1  a  10  100
1  2  b  10  200
2  3  c  10  300

In [12]:
import pandas as pd
df=pd.DataFrame({
    'A':[1,2,3],
    'B':['a','b','c']})
df['c']=10
df['d']=[100,200,300]
df['e']=df['A']*2
df

   A  B   c    d  e
0  1  a  10  100  2
1  2  b  10  200  4
2  3  c  10  300  6

In [14]:
import pandas as pd
r=pd.read_csv('56.csv')
print (r)

  first name  lastname  age  phone no    address  salary
0       rahul       rs   20   9876564     jaipur   12000
1        renu       vr   28   7654890  rajasthan   15000
2      nayana        n   26  65432890         uk   60000
3      kaviya        k   47   9870654         ny   50000
4    santhosh        l   36   4567890        usa   40000
5     athulya        s   29   3455768    hungary   30000
6     nandana        n   33    765890   zimbawee   20000
7      jaymon        j   25  21345678      italy  100000
8       hanah        h   24   9057834   malaysia   17000
9     parthan       ss   30    856721     kerala   40000

In [15]:
import pandas as pd
df=pd.read_csv('56.csv')
df.drop_duplicates()
print (r)

  first name  lastname  age  phone no    address  salary
0       rahul       rs   20   9876564     jaipur   12000
1        renu       vr   28   7654890  rajasthan   15000
2      nayana        n   26  65432890         uk   60000
3      kaviya        k   47   9870654         ny   50000
4    santhosh        l   36   4567890        usa   40000
5     athulya        s   29   3455768    hungary   30000
6     nandana        n   33    765890   zimbawee   20000
7      jaymon        j   25  21345678      italy  100000
8       hanah        h   24   9057834   malaysia   17000
9     parthan       ss   30    856721     kerala   40000

In [20]:
import pandas as pd
df=pd.read_csv('58.csv')
print(df.dropna())

  first name  lastname   age  phone no    address    salary
0       rahul       rs  20.0   9876564     jaipur   12000.0
1        renu       vr  28.0   7654890  rajasthan   15000.0
2      nayana        n  26.0  65432890         uk   60000.0
4    santhosh        l  36.0   4567890        usa   40000.0
5     athulya        s  29.0   3455768    hungary   30000.0
7      jaymon        j  25.0  21345678      italy  100000.0
8       hanah        h  24.0   9057834   malaysia   17000.0
9     parthan       ss  30.0    856721     kerala   40000.0

In [21]:
import pandas as pd
df=pd.read_csv('58.csv')
print(df.fillna(0))

  first name  lastname   age  phone no    address    salary
0       rahul       rs  20.0   9876564     jaipur   12000.0
1        renu       vr  28.0   7654890  rajasthan   15000.0
2      nayana        n  26.0  65432890         uk   60000.0
3      kaviya        k   0.0   9870654         ny   50000.0
4    santhosh        l  36.0   4567890        usa   40000.0
5     athulya        s  29.0   3455768    hungary   30000.0
6     nandana        n   0.0    765890   zimbawee       0.0
7      jaymon        j  25.0  21345678      italy  100000.0
8       hanah        h  24.0   9057834   malaysia   17000.0
9     parthan       ss  30.0    856721     kerala   40000.0

In [22]:
import pandas as pd
df=pd.read_csv('58.csv')
print(df.fillna("unknown"))

  first name  lastname      age  phone no    address    salary
0       rahul       rs     20.0   9876564     jaipur   12000.0
1        renu       vr     28.0   7654890  rajasthan   15000.0
2      nayana        n     26.0  65432890         uk   60000.0
3      kaviya        k  unknown   9870654         ny   50000.0
4    santhosh        l     36.0   4567890        usa   40000.0
5     athulya        s     29.0   3455768    hungary   30000.0
6     nandana        n  unknown    765890   zimbawee   unknown
7      jaymon        j     25.0  21345678      italy  100000.0
8       hanah        h     24.0   9057834   malaysia   17000.0
9     parthan       ss     30.0    856721     kerala   40000.0

In [24]:
import pandas as pd
df=pd.read_csv('58.csv')
df['age']=pd.to_numeric(df['age'],errors='coerce')
df['age']=df['age'].fillna(df['age'].mean())
df

  first name  lastname    age  phone no    address    salary
0       rahul       rs  20.00   9876564     jaipur   12000.0
1        renu       vr  28.00   7654890  rajasthan   15000.0
2      nayana        n  26.00  65432890         uk   60000.0
3      kaviya        k  27.25   9870654         ny   50000.0
4    santhosh        l  36.00   4567890        usa   40000.0
5     athulya        s  29.00   3455768    hungary   30000.0
6     nandana        n  27.25    765890   zimbawee       NaN
7      jaymon        j  25.00  21345678      italy  100000.0
8       hanah        h  24.00   9057834   malaysia   17000.0
9     parthan       ss  30.00    856721     kerala   40000.0

In [25]:
import pandas as pd
df=pd.read_csv('58.csv')
df['age']=pd.to_numeric(df['age'],errors='coerce')
df['age']=df['age'].fillna(df['age'].mean())
df.to_csv("outoutfile.csv")

In [27]:
import pandas as pd
df=pd.read_csv('58.csv')
df.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7    False
8    False
9    False
dtype: bool

In [28]:
import pandas as pd
df=pd.read_csv('59.csv')
df.drop_duplicates()

  first name  lastname   age  phone no    address    salary
0       rahul       rs  20.0   9876564     jaipur   12000.0
1      nayana       vr  28.0   7654890  rajasthan   15000.0
2      nayana       vr  26.0  65432890         uk   60000.0
3      kaviya        k   NaN   9870654         ny   50000.0
4    santhosh        l  36.0   4567890        usa   40000.0
5     athulya        s  29.0   3455768    hungary   30000.0
6     nandana        n   NaN    765890   zimbawee       NaN
7      jaymon        j  25.0  21345678      italy  100000.0
8       hanah        h  24.0   9057834   malaysia   17000.0
9     parthan       ss  30.0    856721     kerala   40000.0

In [29]:
import pandas as pd
df=pd.read_csv('60.csv')
df.drop_duplicates()

  first name  lastname   age  phone no   address    salary
0       rahul       rs  20.0   9876564    jaipur   12000.0
1      nayana       vr  28.0   7654890        uk   40000.0
3      kaviya        k   NaN   9870654        ny   50000.0
4    santhosh        l  36.0   4567890       usa   80000.0
5     athulya        s  29.0   3455768   hungary   30000.0
6     nandana        n   NaN    765890  zimbawee       NaN
7      jaymon        j  25.0  21345678     italy  100000.0
8       hanah        h  24.0   9057834  malaysia   17000.0
9     parthan       ss  30.0    856721    kerala   40000.0

In [1]:
import pandas as pd
df = pd.read_csv('60.csv')
y=df.drop_duplicates()
print(y)
y.to_csv("outyymoutfile.csv")

  first name  lastname   age  phone no   address    salary
0       rahul       rs  20.0   9876564    jaipur   12000.0
1      nayana       vr  28.0   7654890        uk   40000.0
3      kaviya        k   NaN   9870654        ny   50000.0
4    santhosh        l  36.0   4567890       usa   80000.0
5     athulya        s  29.0   3455768   hungary   30000.0
6     nandana        n   NaN    765890  zimbawee       NaN
7      jaymon        j  25.0  21345678     italy  100000.0
8       hanah        h  24.0   9057834  malaysia   17000.0
9     parthan       ss  30.0    856721    kerala   40000.0

In [7]:
import pandas as pd
df=pd.read_csv('60.csv')
df['age']=pd.to_numeric(df['age'],errors='coerce')
df['age']=df['age'].fillna(df['age'].mean())
           
df.to_csv("outoutssfile.csv")
print(df)

  first name  lastname   age  phone no   address    salary
0       rahul       rs  20.0   9876564    jaipur   12000.0
1      nayana       vr  28.0   7654890        uk   40000.0
3      kaviya        k  27.5   9870654        ny   50000.0
4    santhosh        l  36.0   4567890       usa   80000.0
5     athulya        s  29.0   3455768   hungary   30000.0
6     nandana        n  27.5    765890  zimbawee       NaN
7      jaymon        j  25.0  21345678     italy  100000.0
8       hanah        h  24.0   9057834  malaysia   17000.0
9     parthan       ss  30.0    856721    kerala   40000.0

In [9]:
import pandas as pd
df=pd.DataFrame({
    'name':['alice','bob','charlie'],
    'age':[25,30,20]})
df.sort_values(by='age')

      name  age
2  charlie   20
0    alice   25
1      bob   30

In [10]:
import pandas as pd
df=pd.DataFrame({
    'name':['alice','bob','charlie'],
    'age':[25,30,20]},index=[2,0,1])
df.sort_index()

      name  age
0      bob   30
1  charlie   20
2    alice   25

In [14]:
import pandas as pd
df = pd.read_csv('90.csv')
df[df['age']>20]

           name  age gender     country
2       mahroof   22      m         uae
3         gowri   22      f      anayra
4       athulya   22      f      korani
5      parvathy   22  trans    alapuzha
6        midhun   23      m  perunguzhi
7       karthik   22      m    new york
8        sruthi   31      f    abudhabi
9   peterparker   29      m          uk
10       thanos  150  trans       kolam

In [16]:
import pandas as pd
df = pd.read_csv('90.csv')
df[(df['age']>20)&(df['gender']=='f')]

      name  age gender   country
3    gowri   22      f    anayra
4  athulya   22      f    korani
8   sruthi   31      f  abudhabi

In [17]:
import pandas as pd
df = pd.read_csv('90.csv')
df.loc[df['age']>20]

           name  age gender     country
2       mahroof   22      m         uae
3         gowri   22      f      anayra
4       athulya   22      f      korani
5      parvathy   22  trans    alapuzha
6        midhun   23      m  perunguzhi
7       karthik   22      m    new york
8        sruthi   31      f    abudhabi
9   peterparker   29      m          uk
10       thanos  150  trans       kolam

In [18]:
import pandas as pd
df = pd.read_csv('90.csv')
df.loc[df['age']>20,['name','age']]

           name  age
2       mahroof   22
3         gowri   22
4       athulya   22
5      parvathy   22
6        midhun   23
7       karthik   22
8        sruthi   31
9   peterparker   29
10       thanos  150

In [20]:
import pandas as pd
df = pd.read_csv('90.csv')
df.iloc[0:3]

      name  age gender    country
0  charlie   15      m    america
1      ali   18      m  pakisthan
2  mahroof   22      m        uae

In [21]:
import pandas as pd
df = pd.read_csv('90.csv')
df.iloc[0:3,1:3]

   age gender
0   15      m
1   18      m
2   22      m

In [22]:
import pandas as pd
df = pd.read_csv('90.csv')
df[df['name'].str.contains('ali')]

  name  age gender    country
1  ali   18      m  pakisthan

In [29]:
import pandas as pd
df = pd.read_csv('90.csv')
df[df['name'].str.startswith('a')]

      name  age gender    country
1      ali   18      m  pakisthan
4  athulya   22      f     korani

In [30]:
import pandas as pd
df = pd.read_csv('90.csv')
df[df['name'].str.endswith('e')]

      name  age gender  country
0  charlie   15      m  america

In [27]:
import pandas as pd
df = pd.read_csv('90.csv')
df[df['country'].isin(['new york','pakisthan'])]

      name  age gender    country
1      ali   18      m  pakisthan
7  karthik   22      m   new york

In [28]:
import pandas as pd
df = pd.read_csv('90.csv')
df.query("age>20and gender=='f'")

      name  age gender   country
3    gowri   22      f    anayra
4  athulya   22      f    korani
8   sruthi   31      f  abudhabi

In [36]:
import pandas as pd
df = pd.read_csv('346.csv')
grouped=df.groupby('department')
print(grouped['salary'].mean())

department
hr       2500.0
it        750.0
sales    4500.0
Name: salary, dtype: float64

In [37]:
import pandas as pd
df = pd.read_csv('346.csv')
grouped=df.groupby('department')
print(grouped['salary'].sum())

department
hr       5000
it       1500
sales    9000
Name: salary, dtype: int64

In [38]:
import pandas as pd
df = pd.read_csv('346.csv')
df.groupby('department')['salary'].sum()

department
hr       5000
it       1500
sales    9000
Name: salary, dtype: int64

In [39]:
import pandas as pd
df = pd.read_csv('346.csv')
df.groupby('department')['salary'].agg(['mean','max','min'])

              mean   max   min
department
hr          2500.0  3000  2000
it           750.0  1000   500
sales       4500.0  5000  4000

In [40]:
import pandas as pd
df = pd.read_csv('346.csv')
df.groupby(['department','employee'])['salary'].sum()

department  employee
hr          charlie     3000
            eva         2000
it          david        500
            frank       1000
sales       alice       5000
            bob         4000
Name: salary, dtype: int64

In [41]:
import pandas as pd
df = pd.read_csv('346.csv')
df.groupby('department')['salary'].agg(total_salary='sum',average_salary='mean',num_employees='count')

            total_salary  average_salary  num_employees
department
hr                  5000          2500.0              2
it                  1500           750.0              2
sales               9000          4500.0              2

In [5]:
import pandas as pd
df1=pd.DataFrame({
    'a':[1,2],
    'b':[3,4]})
df2=pd.DataFrame({
    'a':[5,6],
    'b':[7,8]})
pd.concat([df1,df2],axis=1)

   a  b  a  b
0  1  3  5  7
1  2  4  6  8

In [8]:
import pandas as pd
df1=pd.DataFrame({
   'key':['a','b','c'],
    'value':[1,2,3]})      
df2=pd.DataFrame({   
    'key':['a','b','d'],
    'value2':[7,8,10]})
result=pd.merge(df1,df2,on='key')
print(result)

  key  value  value2
0   a      1       7
1   b      2       8

In [9]:
import pandas as pd
df1=pd.DataFrame({
   'key':['a','b','c'],
    'value':[1,2,3]})      
df2=pd.DataFrame({   
    'key':['a','b','d'],
    'value2':[7,8,10]})
result=pd.merge(df1,df2,on='key',how='left')
print(result)

  key  value  value2
0   a      1     7.0
1   b      2     8.0
2   c      3     NaN

In [10]:
import pandas as pd
df1=pd.DataFrame({
   'key':['a','b','c'],
    'value':[1,2,3]})      
df2=pd.DataFrame({   
    'key':['a','b','d'],
    'value2':[7,8,10]})
result=pd.merge(df1,df2,on='key',how='right')
print(result)

  key  value  value2
0   a    1.0       7
1   b    2.0       8
2   d    NaN      10

In [11]:
import pandas as pd
df1=pd.DataFrame({'id':[1,2],'Name':['alice','bob']})
df2=pd.DataFrame({'id':[1,2],'score':[90,85]})
pd.merge(df1,df2,on='id')

   id   Name  score
0   1  alice     90
1   2    bob     85

In [12]:
import pandas as pd
df1=pd.DataFrame({'Name':['alice','bob']},index=[0,1])
df2=pd.DataFrame({'score':[90,85]},index=[0,1])
df1.join(df2)

    Name  score
0  alice     90
1    bob     85

In [15]:
import pandas as pd
df1=pd.DataFrame({'key':[3,3],'Name':['alice','bob']},index=[0,1])
df2=pd.DataFrame({'key':[4,6],'score':[90,85]},index=[0,1])
df1.join(df2.set_index('key'),on='key')

   key   Name  score
0    3  alice    NaN
1    3    bob    NaN

In [18]:
import pandas as pd
df1=pd.DataFrame({
    'a':[1,2],
    'b':[3,4]})
df2=pd.DataFrame({
    'a':[5,6],
    'b':[7,8]})
result=pd.concat([df1,df2],ignore_index=True)
print(result)

   a  b
0  1  3
1  2  4
2  5  7
3  6  8

In [20]:
import pandas as pd
df = pd.read_csv('908.csv')
df.groupby(['studentname','subject'])['mark'].sum()

studentname  subject
baby         sanskrit       90
chandra      statastics     55
kingini      german         60
lakshmi      hindi          64
manu         social         80
neli         french         45
paru         english        88
raju         science        70
thankama     mathematics    77
vanaja       malayalam      87
vasu         computer       50
Name: mark, dtype: int64

In [23]:
import pandas as pd
df = pd.read_csv('908.csv')
df.groupby('studentname')['mark'].agg(['mean','max','min'])

             mean  max  min
studentname
baby         90.0   90   90
chandra      55.0   55   55
kingini      60.0   60   60
lakshmi      64.0   64   64
manu         80.0   80   80
neli         45.0   45   45
paru         88.0   88   88
raju         70.0   70   70
thankama     77.0   77   77
vanaja       87.0   87   87
vasu         50.0   50   50

In [24]:
import pandas as pd
df = pd.read_csv('908.csv')
df.groupby('studentname')['mark'].agg(total_mark='sum',average_mark='mean',num_mark='count')

             total_mark  average_mark  num_mark
studentname
baby                 90          90.0         1
chandra              55          55.0         1
kingini              60          60.0         1
lakshmi              64          64.0         1
manu                 80          80.0         1
neli                 45          45.0         1
paru                 88          88.0         1
raju                 70          70.0         1
thankama             77          77.0         1
vanaja               87          87.0         1
vasu                 50          50.0         1

In [31]:
import pandas as pd
df = pd.read_csv('098.csv')
agg1=df.groupby('subject')['mark'].agg(total_mark='sum',average_mark='mean',num_mark='count')
agg2=df.groupby('subject')['mark'].agg(['mean','max','min'])
print(agg1)
print(agg2)

         total_mark  average_mark  num_mark
subject
english         167     83.500000         2
french          239     79.666667         3
german          160     53.333333         3
science         200     66.666667         3
              mean  max  min
subject
english  83.500000   90   77
french   79.666667   88   64
german   53.333333   60   45
science  66.666667   80   50

In [59]:
import pandas as pd
df = pd.read_csv('567.csv')
df['total'] = df[['german', 'french', 'arabic', 'malayalam']].sum(axis=1)
df.groupby('student name')['total'].agg(total_mark='sum',average_mark='mean',num_mark='count')

              total_mark  average_mark  num_mark
student name
daya                 472         236.0         2
jithin               305         305.0         1
mani                 300         300.0         1
paru                 297         297.0         1

In [13]:
import pandas as pd
df = pd.read_csv('567.csv')
df['total'] = df[['german', 'french', 'arabic', 'malayalam']].sum(axis=1)
df.groupby(['student name','total']).mean()

                    german  french  arabic  malayalam
student name total
daya         160      20.0    47.0    56.0       37.0
             312      90.0    87.0    68.0       67.0
jithin       305      70.0    67.0    78.0       90.0
mani         300      79.0    87.0    56.0       78.0
paru         297      68.0    76.0    64.0       89.0

In [61]:
import pandas as pd
s=pd.Series([1,2,3,4])
s.map(lambda x: x*10)

0    10
1    20
2    30
3    40
dtype: int64

In [62]:
import pandas as pd
s=pd.Series([1,2,3,4])
s.apply(lambda x: x**10)

0          1
1       1024
2      59049
3    1048576
dtype: int64

In [64]:
import pandas as pd
df=pd.DataFrame({
    'a':[1,2],
    'b':[3,4]})
df['a'].apply(lambda x:x+100)

0    101
1    102
Name: a, dtype: int64

In [65]:
import pandas as pd
df=pd.DataFrame({
    'a':[1,2],
    'b':[3,4]})
df.apply(lambda row:row['a']+row['b'],axis=1)

0    4
1    6
dtype: int64

In [72]:
import pandas as pd
df=pd.DataFrame({
    'a':[1,2],
    'b':[3,4]})
df.applymap(lambda x:x*2)

C:\Users\Euroview7\AppData\Local\Temp\ipykernel_3712\3574301537.py:5: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  df.applymap(lambda x:x*2)

   a  b
0  2  6
1  4  8

In [9]:
import pandas as pd
s=pd.Series(['nil','meam','median','what'])
s.map(lambda x: x*3)

0             nilnilnil
1          meammeammeam
2    medianmedianmedian
3          whatwhatwhat
dtype: object

In [7]:
import pandas as pd
df=pd.DataFrame({
    'a':['get','man'],
    'b':['out','boy']})
df.applymap(lambda x:x*1)

C:\Users\Euroview7\AppData\Local\Temp\ipykernel_15100\119910991.py:5: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  df.applymap(lambda x:x*1)

     a    b
0  get  out
1  man  boy

In [11]:
import pandas as pd
s=pd.Series(['nil','meam','median','what'])
s.apply(lambda x: x*10)

0                       nilnilnilnilnilnilnilnilnilnil
1             meammeammeammeammeammeammeammeammeammeam
2    medianmedianmedianmedianmedianmedianmedianmedi...
3             whatwhatwhatwhatwhatwhatwhatwhatwhatwhat
dtype: object

In [16]:
import pandas as pd
df = pd.read_csv('567.csv')
#df['total'] = df[['german', 'french', 'arabic', 'malayalam']].sum(axis=1)
df.groupby(['student name']).mean()

              german  french  arabic  malayalam
student name
daya            55.0    67.0    62.0       52.0
jithin          70.0    67.0    78.0       90.0
mani            79.0    87.0    56.0       78.0
paru            68.0    76.0    64.0       89.0

In [20]:
import pandas as pd
data= pd.read_csv('329.csv')
df=pd.DataFrame(data)
pivot=df.pivot_table(values='salary',index='department',columns='gender',aggfunc='mean',fill_value=0)
print(pivot)

gender          f       m
department
hr          200.0  1000.0
it          400.0   300.0
sales       800.0   250.0

In [24]:
import pandas as pd
data= pd.read_csv('329.csv')
df=pd.DataFrame(data)
crosstab=pd.crosstab(df['department'],df['gender'])
print(crosstab)

gender      f  m
department
hr          1  1
it          1  1
sales       1  1

In [30]:
import pandas as pd
data= pd.read_csv('346.csv')
df=pd.DataFrame(data)
crosstab_sum=pd.crosstab(df['department'],df['employee'],df['salary'],aggfunc='sum')
print(crosstab_sum)

employee     alice     bob  charlie  david     eva   frank
department
hr             NaN     NaN   3000.0    NaN  2000.0     NaN
it             NaN     NaN      NaN  500.0     NaN  1000.0
sales       5000.0  4000.0      NaN    NaN     NaN     NaN

In [38]:
import pandas as pd
data= pd.read_csv('02345.csv')
df=pd.DataFrame(data)
pivot=df.pivot_table(values='monthly salary',index='department',aggfunc='mean',fill_value=0)
print(pivot)

                   monthly salary
department
admin officer               400.0
assist manager             1100.0
clerk                       625.0
digital marketing           350.0
it                          500.0
manager                    1450.0
security                    450.0